In [1]:
# melt : convert wide data to long data

In [2]:
import pandas as pd

In [15]:
df = pd.DataFrame({
    "District" : ["Jhrsuguda", "Sundargarh", "Sambalpur", "Deogarh"],
    "area" : [15000, 2000, 3000, 1000],
    "year" : [1900, 1901, 1902, 1903],
    "market" : [1200, 455, 6700, 5000],
    # "tax" : [20, 30, 25, 15]
})

In [17]:
melted_df = df.melt(
    id_vars = ["District", "area"], # Those column are as it is
    value_vars = ["year", "market"], # Rest columns
    var_name = "Others", # column name store under Others
    value_name = "Value" 
)

melted_df

     District   area  Others  Value
0   Jhrsuguda  15000    year   1900
1  Sundargarh   2000    year   1901
2   Sambalpur   3000    year   1902
3     Deogarh   1000    year   1903
4   Jhrsuguda  15000  market   1200
5  Sundargarh   2000  market    455
6   Sambalpur   3000  market   6700
7     Deogarh   1000  market   5000

In [21]:
# pivot : Convert long data to wide
original_df = melted_df.pivot(
    index = ["District", "area"],
    columns = "Others",
    values = "Value"
)

original_df

Others            market  year
District   area
Deogarh    1000     5000  1903
Jhrsuguda  15000    1200  1900
Sambalpur  3000     6700  1902
Sundargarh 2000      455  1901